УТ_для_edt/src/InformationRegisters/смартВходящиеСобытияВзаимодействий/смартВходящиеСобытияВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВходящиеСобытияВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КемОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КогдаОбработано</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Партнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидСобытия</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>EnumRef.смартВидыСобытийВзаимодействий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыСобытийВзаимодействий/смартВидыСобытийВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыСобытийВзаимодействий</name>
  <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  <enumValues>
    <name>ВходящийТелефонныйЗвонок</name>
    <comment>#1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С</comment>
  </enumValues>
  <enumValues>
    <name>СозданиеДокументаИнтерес</name>
    <comment>#1760 смарт: Ермаков 12.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.</comment>
  </enumValues>
  <enumValues>
    <name>НайденСуществующийПартнер</name>
    <comment>#1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.	</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/смартСобытияВзаимодействийГлобальный/Module.bsl
////////////////////////////////////////////////////////////
// Модуль смартСобытияВзаимодействийГлобальный предназначен для 
// хранения процедур и функций, связанных с событиями взаимодействий.
// Примеры:
//  - интерактивная работа с пользователем
//	- взаимосвязь внешних событий и пользователей
//	- и подобное
// 
// Модуль создал - Ермаков, 12.04.2024
////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Подключается обработчиком ожидания в ПриНачалеРаботыСистемы
Процедура ОбработатьВходящееСобытиеВзаимодействия() Экспорт
	
	//++ #1747 смарт: Ермаков 05.04.2024 / Интеграция телефонии в 1C:СRM - Создание HTTP Сервиса для оповещения 1С
	Данные = Неопределено;
	
	//++ #Б-1114 смарт: Ермаков 09.10.2024 / Поиск и устранение перерасхода ресурсов сервера
	Если СтандартныеПодсистемыКлиент.ПараметрКлиента("ЭтоСекретарь") Тогда
    //-- #Б-1114 смарт: Ермаков 09.10.2024
	
		ВидСобытия = ПредопределенноеЗначение("Перечисление.смартВидыСобытийВзаимодействий.ВходящийТелефонныйЗвонок"); 
		
		Если смартСобытияВзаимодействий.ПолучитьДанныеСобытияВзаимодействий(ВидСобытия, Данные) Тогда
			
			Если Не Данные = Неопределено Тогда
				Оповестить("ВходящийТелефонныйЗвонок", Данные, "смартГлобальный.ОбработатьВходящееСобытиеВзаимодействия");
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;		
	//-- #1747 смарт: Ермаков 05.04.2024
	
	//++ #1760 смарт: Ермаков 05.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
	//++ #Б-1114 смарт: Ермаков 09.10.2024 / Поиск и устранение перерасхода ресурсов сервера  
	Если СтандартныеПодсистемыКлиент.ПараметрКлиента("ИспользуетПодсистемуCRM") Тогда
	//-- #Б-1114 смарт: Ермаков 09.10.2024
	
		//++ #1760 смарт: Ермаков 05.04.2024 / Создание механизма оповещений менеджеров о назначенных Интересах.
		ВидСобытия = ПредопределенноеЗначение("Перечисление.смартВидыСобытийВзаимодействий.СозданиеДокументаИнтерес");
			
		Если смартСобытияВзаимодействий.ПолучитьДанныеСобытияВзаимодействий(ВидСобытия, Данные) Тогда
			
			Если Не Данные = Неопределено Тогда
				
				Если Данные.НаборДанных.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				
				ИдентификаторСобытия = Данные.НаборДанных[0].ИдентификаторСобытия; 
				
				ОткрытьФорму("РегистрСведений.смартВходящиеСобытияВзаимодействий.Форма.ФормаСобытияСозданиеДокументаИнтерес", 
					Данные,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(ИдентификаторСобытия);
				
			КонецЕсли;
			
		КонецЕсли;   
		//-- #1760 смарт: Ермаков 05.04.2024
		
		//++ #1789 смарт: Ермаков 22.04.2024 / Доработка механизма оповещений менеджеров.
		ВидСобытия = ПредопределенноеЗначение("Перечисление.смартВидыСобытийВзаимодействий.НайденСуществующийПартнер");
			
		Если смартСобытияВзаимодействий.ПолучитьДанныеСобытияВзаимодействий(ВидСобытия, Данные) Тогда
			
			Если Не Данные = Неопределено Тогда
				
				Если Данные.НаборДанных.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				
				ИдентификаторСобытия = Данные.НаборДанных[0].ИдентификаторСобытия; 
				
				ОткрытьФорму("РегистрСведений.смартВходящиеСобытияВзаимодействий.Форма.ФормаСобытияСозданиеДокументаИнтерес", 
					Данные,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				смартСобытияВзаимодействий.ОбработатьДанныеСобытияВзаимодействий(ИдентификаторСобытия);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #1789 смарт: Ермаков 22.04.2024
	
КонецПроцедуры

#КонецОбласти
